___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

need to pip install: 
sqlalchemy
lxml
html5lib
BeautifulSoup4

In [15]:
import numpy as np
import pandas as pd

In [16]:
pwd

'C:\\Users\\raiu\\Desktop\\_\\Desktop\\code\\udemy bootcamp\\Python for Data Science and ML\\follow along lecture notes\\03-Python-for-Data-Analysis-Pandas'

In [17]:
# present working directory to see where my jupyter notebook is
# the excel files and such need to be in the same folder as my jupyter notebook or else need to specify

## CSV

### CSV Input

In [18]:
# "pd.read_csv()" and pass in the .csv file as an argument (minus the .csv)

df = pd.read_csv('example') # the file name is "example.csv" but we cut out the ".csv"

df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
# if you write "pd.read_" and hit tab, you can see where pandas can read data from
# if you write "df.to_" and hit tab, you can see where you can write your dataframe to (basically all the formats you can read
# from)

### CSV Output

In [20]:
df.to_csv('my_output')

pd.read_csv('my_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [21]:
df.to_csv('my_output', index=False)

# ", index=False" is for when I don't want to save the index as a column
# if you don't specify, it'll show your old index in the new file

df

# you will not assign the old index and it will automatically assign a range index to the data frame

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [22]:
df.to_csv('my_output')

pd.read_csv('my_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas, macros, nor images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [28]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

# "Excel_Sample.xlsx" needs to be in the same folder as this jupyter notebook or we will need to pass in the whole file path
# this is what the table should look like: https://docs.google.com/spreadsheets/d/1Yrib5-uSo27yT1ZytW11sePCUIHNPVRs4ahgZYIDanA/edit#gid=1692713163
# not sure why it has an "unnamed" index

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

### Excel Output

In [30]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='NewSheet')

df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

- FYI: this is basically just webscraping with pandas

In [32]:
data_frame = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [33]:
data_frame[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
1,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
2,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
3,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
4,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
...,...,...,...,...,...,...,...
563,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
564,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
565,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
566,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
567,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [35]:
type(data_frame)

# pandas found every table element in the html file

list

In [36]:
data_frame[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
1,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
2,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
3,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
4,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539

____

_____
_____
# SQL (Optional)

* Note: If you are completely unfamiliar with SQL you can check out my other course: "Complete SQL Bootcamp" to learn SQL.

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Python’s standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [37]:
from sqlalchemy import create_engine

In [38]:
engine = create_engine('sqlite:///:memory:')

# this line of code creates a very small very temporary, very small sqlite engine database that's running in memory

In [39]:
df.to_sql('my_data_table', engine)

# engine is connection
# it is usually not the best to read sql into pandas directly, should look for python libraries for whatever version of sql

4

In [42]:
sql_df = pd.read_sql('my_data_table',con=engine)

# "con=engine" is establishing the connection

In [43]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

# Great Job!